{"intents": [
    {
    "tag": "Fare Enquiry", "patterns": ["Can you tell me the price for a one-way ticket from New York to London?", "How much does it cost to upgrade to business class?", "Do you offer any discounts for military personnel or senior citizens?", "What is the price of a round-trip ticket from Los Angeles to Tokyo?", "Are there any promo codes or special deals available for flights to Paris?"], "responses": ["The price of a one-way ticket from New York to London depends on the date of travel and class of service. Please provide me with the date and class you are interested in, and I can give you an accurate quote.", "The cost of upgrading to business class varies depending on the flight and availability. Please let me know the flight details, and I can check for you.", "We do offer discounts for military personnel and senior citizens. Please provide me with more information about your travel plans, and I can check for available discounts.", "The price of a round-trip ticket from Los Angeles to Tokyo depends on the date of travel and class of service. Please provide me with the date and class you are interested in, and I can give you an accurate quote.", "We do offer promo codes and special deals from time to time. Please check our website or social media pages for current promotions."]},
{
    "tag": "greeting",
    "patterns": [
      "Hi",
      "Hello",
      "Hey there",
      "Greetings"
    ],
    "responses": [
      "Hello! How can I assist you today?",
      "Hi there! How can I help you today?",
      "Hey, how can I help you today?",
      "Nice to meet you! How may I assist you?"
    ]
  },
  {
    "tag": "goodbye",
    "patterns": [
      "Bye",
      "Goodbye",
      "See you later",
      "Adios"
    ],
    "responses": [
      "Goodbye! Have a great day!",
      "Bye! Come back soon!",
      "See you later! Take care!",
      "Adios! Hasta la vista!"
    ]
  },
  {
    "tag": "thanks",
    "patterns": [
      "Thank you",
      "Thanks",
      "Appreciate it",
      "Gracias"
    ],
    "responses": [
      "You're welcome!",
      "No problem!",
      "Glad I could help!"
    ]},
    {
        "tag": "noanswer",
        "patterns": [],
        "responses": [
            "Sorry, can't understand you",
            "Please give me more info",
            "Not sure I understand"
        ],
        "context": [
            ""
        ]
    },
    {
        "tag": "whatsup",
        "patterns": [
            "Whats up",
            "Wazzup",
            "How are you",
            "sup","How you doing"
        ],
        "responses": [
            "All good..What about you?"
        ]
    },
    {
        "tag": "exclaim",
        "patterns": [
            "Awesome",
            "Great",
            "I know",
            "ok",
            "yeah"
        ],
        "responses": [
            "Yeah!"
        ]
    },
    {
        "tag": "appreciate",
        "patterns": [
            "You are awesome",
            "you are the best",
            "you are great",
            "you are good"
        ],
        "responses": [
            "Thank you!"
        ]
    },
    {
        "tag": "no",
        "patterns": [
            "no",
            "nope"
        ],
        "responses": [
            "ok"
        ]
    },
    {
        "tag": "developer",
        "patterns": [
            "who is he",
            "who is that",
            "who made you"
        ],
        "responses": [
            "I was developed by three engineering students, currently studying in vel tech university, chennai"
        ]
    },
    {
        "tag": "Flight_Booking", "patterns": ["Can you help me book a flight from Boston to Miami for next weekend?", "What is the process for booking a flight on your airline?", "Can I make changes to my booking after it has been confirmed?", "How can I pay for my flight booking?", "Is it possible to book a flight and hotel package through your airline?"], "responses": ["Yes, I can help you book a flight from Boston to Miami for next weekend. Please provide me with the travel dates and other requirements, and I can find available flights for you.", "The process for booking a flight on our airline is easy and can be done online, through our mobile app, or by contacting our customer service team.", "Yes, you can make changes to your booking after it has been confirmed. However, please note that there may be change fees or fare differences depending on the type of change you make.", "We accept various payment methods, including credit/debit cards, bank transfers, and PayPal.", "Yes, we offer flight and hotel package deals. Please provide me with your travel details, and I can check for available options."]}, {
        "tag": "flight_status", "patterns": ["Can you tell me if my flight from Chicago to Seattle is on time?", "How do I check the status of my flight?", "Are there any delays or cancellations for flights to New York today?", "What time will my flight from Miami to Las Vegas depart?", "Has the gate for my flight to London been announced yet?"], "responses": ["Yes, I can check if your flight from Chicago to Seattle is on time. Please provide me with your flight details, and I will check the status for you.", "You can check the status of your flight on our website or mobile app. You can also receive updates via email or text message.", "I am sorry to inform you that there is a delay/cancellation for flights to New York today. Please check our website or mobile app for further information and updates.", "The departure time for your flight from Miami to Las Vegas is 7:45 PM local time. Please note that this information is subject to change.", "The gate for your flight to London has not been announced yet. Please check the departure screens or ask a staff member for assistance."]}, {
        "tag": "baggage_enquiry", "patterns": ["What is the baggage allowance for economy class passengers?", "How much does it cost to check an extra bag?", "Can I bring a carry-on bag in addition to my checked baggage?", "What items are prohibited in checked baggage?", "What should I do if my baggage is lost or damaged?"], "responses": ["The baggage allowance for economy class passengers varies depending on the route and class of service. Please check our website or contact our customer service team for more information.", "The cost of checking an extra bag also depends on the route and class of service. Please let me know the details of your trip, and I can check for you.", "Yes, you can bring a carry-on bag in addition to your checked baggage. Please check our website for size and weight restrictions.", "Certain items are prohibited in checked baggage, including dangerous goods and hazardous materials. Please check our website for a list of prohibited items.", "If your baggage is lost or damaged, please report it immediately to our baggage service desk. Our staff will assist you with the necessary procedures and compensation."]}, {
        "tag": "seat_selection", "patterns": ["Can I choose my seat when booking a flight?", "How do I select a seat after booking my flight?", "What are the options for seat upgrades?", "Is there an additional fee for selecting a specific seat?", "Can I change my seat selection after I have booked my flight?"], "responses": ["Yes, you can choose your seat when booking a flight. Please select your preferred seat during the booking process.", " if you have already booked your flight and would like to select a seat, you can do so online or through our mobile app. You can also contact our customer service team for assistance.", "The options for seat upgrades vary depending on the flight and availability. Please let me know your flight details, and I can check for available upgrades.", "Yes, there may be an additional fee for selecting a specific seat, depending on the class you booking", "sign up for the frequent flyer program of your preferred airline.This is usually free, and you can usually sign up online."]}, {
        "tag": "cancellation_policy", "patterns": ["What is your cancellation policy for flights?", "Can I cancel my flight and receive a refund?", "Is there a fee for cancelling a flight?", "How much notice do I need to give before cancelling a flight?", "Can I change the date of my flight instead of cancelling it?"], "responses": ["Our airline's cancellation policy varies depending on the type of ticket purchased. ", "Generally, non-refundable tickets cannot be cancelled, while refundable tickets can be cancelled for a fee", "The fee amount and cancellation notice period also vary by ticket type", "Please refer to your ticket details or contact our customer service team for specific information.", "Yes, it is generally possible to change the date of your flight instead of cancelling it. The process and fees for changing a flight date may vary depending on the airline and the type of ticket you purchased."]}, {
        "tag": "frequent_flyer_program", "patterns": ["Can you tell me more about your frequent flyer program?", "How do I sign up for the frequent flyer program?", "What are the benefits of being a frequent flyer member?", "How do I earn and redeem miles in the frequent flyer program?", "Is there a fee for joining the frequent flyer program?"], "responses": ["Our airline offers a frequent flyer program that rewards members for their travel with our airline.", "To sign up, you can visit our website or contact our customer service team", "Benefits of being a frequent flyer member include earning and redeeming miles for flights and other rewards, priority check-in, boarding, and baggage handling, and access to airport lounges.", "Sign up for the frequent flyer program of your preferred airline.This is usually free, and you can usually sign up online.", "In most of cases there is no fee for joining the frequent flyer program"]}, {
        "tag": "travel_documents", "patterns": ["What travel documents do I need for international travel?", "How long does it take to get a passport?", "Can I travel internationally with an expired passport?", "What other documents do I need besides a passport for international travel?", "Do I need a visa for the country I am travelling to?"], "responses": ["The travel documents required for international travel vary depending on the destination country and the passenger's nationality.", "Generally, a valid passport is required for international travel, and some countries may require a visa.", "It is recommended to check with the destination country's embassy or consulate for specific travel requirements", "The time it takes to obtain a passport also varies by country, so it's important to plan ahead and allow sufficient time for the passport application process.", "Whether you need a visa or not depends on your destination country and nationality"]}, {
        "tag": "on-board_services", "patterns": ["What on-board services are available for passengers?", "Are meals provided on the flight?", "What entertainment options are available on the flight?", "Is there Wi-Fi available on the flight?", "Are there any additional services available for business class passengers?"], "responses": ["Our airline offers a range of on-board services for passengers, including meals and snacks, entertainment options such as movies and TV shows, and Wi-Fi on select flights.", "Business class passengers may also have access to additional services such as priority boarding, more spacious seating, and enhanced dining options.", "Entertainment are like tv,newspaper etc.", "it is based on the flight and airlines that you select", "no ,there is no additonal charges"]}, {
        "tag": "flight_change", "patterns": ["Can I change the date of my flight?", "How can I change my flight booking?", "What is the fee for changing a flight?", "Is it possible to change my seat on a flight?", "Can I change my flight to a different airline?"], "responses": ["Yes, you can change the date of your flight. You can change your flight booking online or by contacting the airline's customer service.", "There is usually a fee for changing a flight, which varies depending on the airline and the type of ticket you purchased.", "You can also request to change your seat on a flight, subject to availability.", "It may be possible to change your flight to a different airline, but this will depend on the airline's policies and availability.", "To check if your flight is delayed, you can visit the airline's website or contact their customer service. "]}, {
        "tag": "flight_delay", "patterns": ["Is my flight delayed?", "How long is my flight delayed for?", "What is the reason for the flight delay?", "Will I miss my connecting flight because of the delay?", "How can I get updates on the status of my delayed flight?"], "responses": ["The duration of the delay will depend on the reason for the delay, which can range from weather conditions to mechanical issues.", "If you have a connecting flight, you may miss it due to the delay.", "you can get updates on the status of your delayed flight by checking the airline's website or mobile app, or by signing up for text or email notifications.", "no ,you will catch your connecting flight", "you can get through email,phone ,airline app."]}, {
        "tag": "flight_cancellation", "patterns": ["Has my flight been cancelled?", "Can I get a refund for my cancelled flight?", "What are my options if my flight is cancelled?", "Is there another flight I can take instead of the cancelled one?", "How can I rebook my flight if it has been cancelled?"], "responses": [" If your flight has been cancelled, you may be eligible for a refund or another flight. ", "You can check if your flight has been cancelled by visiting the airline's website or contacting their customer service. ", "You may be able to get a refund for your cancelled flight, but this will depend on the airline's policies and the type of ticket you purchased.", "yes u can take instead of the cancelled flight.", "You can rebook your flight by contacting the airline's customer service or using their website or mobile app."]}, {
        "tag": "route_enquiry", "patterns": ["What are the routes available for my destination?", "Can I fly directly to my destination?", "What are the stopover destinations on my route?", "How long is the flight duration for my route?", "Is there a flight route that is more affordable than the one I selected?"], "responses": ["You can find the available flight routes to your destination by visiting the airline's website or using a flight search engine", " It may be possible to fly directly to your destination, but this will depend on the airline's route network.", "Stopover destinations on your route will also depend on the airline's route network.", "he flight duration for your route will depend on the distance and any stopovers. ", "You can compare flight prices to find a more affordable flight route."]}, {
        "tag": "baggage_claim", "patterns": ["Where can I claim my baggage after my flight?", "How long does it take to receive my baggage after landing?", "What happens if my baggage is lost?", "How can I track my baggage if it is delayed?", "What is the maximum weight for carry-on baggage?"], "responses": ["You can claim your baggage after your flight at the baggage claim area of the airport. ", "The time it takes to receive your baggage after landing will depend on the airline and the airport.", "If your baggage is lost, you can report it to the airline's baggage service desk.", "you can track delayed baggage using the airline's website or mobile app.", "The maximum weight for carry-on baggage varies depending on the airline."]}, {
        "tag": "lost_luggage", "patterns": ["What should I do if my luggage is lost?", "How long does it take to locate lost luggage?", "How can I claim compensation for lost luggage?", "Will the airline deliver the lost luggage to me?", "Can I get reimbursed for items lost in my luggage?"], "responses": [" If your luggage is lost, you can report it to the airline's baggage service desk or using their website or mobile app.", "It may take some time to locate lost luggage, and you can claim compensation for lost luggage if it is not found within a certain period of time. ", "The airline may deliver your lost luggage to you if it is found. You may be able to get reimbursed for items lost in your luggage, but this will depend on the airline's policies.", "Yes they will delivary your luggage", "No, you sholud take care for your luggage"]}, {
        "tag": "damaged_luggage", "patterns": ["What should I do if my luggage is damaged?", "How can I file a claim for damaged luggage?", "Can I get compensation for my damaged luggage?", "Will the airline fix my damaged luggage or replace it?", "Is there a limit to the amount of compensation I can receive for my damaged luggage?"], "responses": ["If your luggage is damaged, you can file a claim with the airline's baggage service desk or using their website or mobile app", "You may be able to get compensation for your damaged luggage, but this will depend on the airline's policies", "The airline may repair your damaged luggage or replace it if it cannot be repaired.", "There may be a limit to the amount of compensation you can receive for your damaged luggage.", "No ,there is nocompensation"]}, {
        "tag": "pet_travel", "patterns": ["Can I travel with my pet on the flight?", "What are the requirements for pet travel?", "How much does it cost to travel with a pet?", "Can my pet fly in the cabin with me?", "Can I bring more than one pet on a flight?"], "responses": ["You can travel with your pet on a flight, but there are requirements and restrictions that vary depending on the airline and the destination. ", "You will need to contact the airline to find out the specific requirements for pet travel, such as documentation and pet carrier size", "The cost to travel with a pet also varies depending on the airline", "tion and pet carrier size. The cost to travel with a pet also varies depending on the airline. ", "It may be possible to bring your pet in the cabin with you, but this is subject to availability and airline policies. "]}, {
        "tag": "special_needs_assistance", "patterns": ["How can the airline assist passengers with special needs?", "Can the airline provide wheelchair assistance?", "What accommodations are available for passengers with disabilities?", "Can I bring my service animal on the flight?", "Is there a special check-in process for passengers with special needs?"], "responses": ["Airlines offer assistance to passengers with special needs such as mobility issues, hearing or visual impairments, or cognitive disabilities.", "Passengers can request wheelchair assistance or other accommodations when booking their flight or by contacting the airline directly.", "All facilities are available", "Service animals are generally allowed on flights, but specific requirements and documentation may vary by airline and destination.", "Some airlines may have a special check-in process for passengers with special needs."]}, {
        "tag": "medical_assistance", "patterns": ["Can the airline provide medical assistance during a flight?", "What medical equipment is available on the flight?", "Can I bring my own medical equipment on the flight?", "Are there any restrictions on flying with a medical condition?", "How can I request medical assistance while on a flight?"], "responses": ["Airlines can provide medical assistance during a flight in case of a medical emergency.", "Some medical equipment such as defibrillators, oxygen tanks, and first aid kits are available on most flights.", "Passengers can generally bring their own medical equipment on the flight, but restrictions may apply, so it's best to check with the airline beforehand.", "Passengers with certain medical conditions may require clearance from their doctor or the airline's medical department before flying.", "Passengers can request medical assistance from the flight crew during the flight, or notify the airline of any special medical needs when booking their flight."]}, {
        "tag": "group_travel", "patterns": ["Can I book tickets for a group of people together?", "Is there any special discount for group travel?", "What is the maximum number of people allowed in a group booking?", "How can I make changes to my group booking?", "What are the requirements for group bookings?"], "responses": ["Yes, you can book tickets for a group of people together.", "Yes, there may be special discounts for group travel depending on the airline's policy.", "The maximum number of people allowed in a group booking may vary depending on the airline's policy.", "You can make changes to your group booking by contacting the airline's customer service or visiting their website.", "Group booking is requied a group photo."]}, {
        "tag": "children_travel", "patterns": ["What documents do I need to carry for my child while traveling?", "Can my child travel alone on a flight?", "Is there any special assistance provided for children traveling alone?", "Are there any restrictions on the age of the child for traveling alone?", "Are there any child-friendly facilities on board the flight?"], "responses": ["The documents required for children traveling may vary depending on the destination and airline's policy. Generally, a valid passport or birth certificate is required.", "Children can travel alone on a flight, but there may be age restrictions depending on the airline's policy.", "Yes, special assistance is provided for children traveling alone. This service may include an escort to and from the aircraft and assistance with connecting flights.", "Yes, there may be age restrictions for children traveling alone depending on the airline's policy.", "Some airlines provide child-friendly facilities on board such as child meals, entertainment, and toys."]}, {
        "tag": "unaccompanied_minors", "patterns": ["Can my child travel as an unaccompanied minor?", "What is the age limit for unaccompanied minors?", "What documents do I need to carry for my child if he/she is traveling as an unaccompanied minor?", "What assistance will be provided to my child if he/she is traveling as an unaccompanied minor?", "What are the additional charges for an unaccompanied minor?"], "responses": ["Yes, your child can travel as an unaccompanied minor.", "The age limit for unaccompanied minors may vary depending on the airline's policy.", "The documents required for unaccompanied minors may vary depending on the destination and airline's policy. Generally, a valid passport or birth certificate is required.", "Assistance will be provided to unaccompanied minors during check-in, boarding, and connecting flights.", "There may be additional charges for unaccompanied minors depending on the airline's policy."]}, {
        "tag": "travel_insurance", "patterns": ["What kind of travel insurance plans do you offer?", "What does the travel insurance cover?", "How can I purchase travel insurance for my trip?", "What are the exclusions in the travel insurance policy?", "Can I cancel the travel insurance policy and get a refund?"], "responses": ["The type of travel insurance plans offered may vary depending on the airline's policy. Generally, they cover trip cancellation, trip interruption, medical expenses, and emergency medical evacuation.", "Travel insurance may cover unexpected events such as trip cancellations, lost luggage, medical emergencies, and accidents.", "You can purchase travel insurance for your trip through the airline's website or by contacting their customer service.", "Exclusions may vary depending on the policy, but they may include pre-existing medical conditions and extreme sports.", "You may be able to cancel your travel insurance policy and receive a refund depending on the airline's policy."]}, {
        "tag": "airport_transfer", "patterns": ["Do you offer airport transfer services?", "How can I book an airport transfer?", "What is the cost of airport transfer service?", "How many people can be accommodated in one airport transfer?", "What is the cancellation policy for airport transfer bookings?"], "responses": ["Yes, some airlines offer airport transfer services.", "You can book an airport transfer by contacting the airline's customer service or through their website.", "The cost of airport transfer service may vary depending on the destination and the airline's policy.", "The number of people accommodated in one airport transfer may vary depending on the airline's policy.", "The cancellation policy for airport transfer bookings may vary depending on the airline's policy."]}, {
        "tag": "visa_enquiry", "patterns": ["What kind of visa do I need to travel to a particular country?", "How can I apply for a visa?", "What are the documents required for a visa application?", "What is the processing time for visa application?", "How can I track my visa application status?"], "responses": ["The type of visa required may vary depending on the destination and the purpose of your travel.", "You can apply for a visa by contacting the embassy or consulate of the country you are traveling to or through a visa application service.", "The documents required for a visa application may vary depending on the destination and the purpose of your travel. Generally, a passport, application form, and photographs are required.", "The processing time for a visa application may vary depending on the destination and the embassy or consulate's workload.", "You can track your visa application status through the embassy or consulate's website or by contacting them directly."]}, {
        "tag": "passport_enquiry", "patterns": ["How can I apply for a passport?", "What are the documents required for passport application?", "What is the processing time for passport application?", "How can I track my passport application status?", "Can I renew my passport online?"], "responses": ["You can apply for a passport by contacting your country's passport office or through an online passport application service.", "The documents required for passport application may vary depending on the country you are applying from. Generally, a birth certificate, identification documents, and photographs are required.", "The processing time for a passport application may vary depending on the country's passport office's workload.", "You can track your passport application status through the passport office's website or by contacting them directly.", "You may be able to renew your passport"]}, {
        "tag": "immigration_check", "patterns": ["What documents do I need to carry for immigration check?", "What are the rules for immigration check at the destination country?", "What is the procedure for immigration check at the airport?", "Can I be denied entry to a country during immigration check?", "What are the penalties for violating immigration rules?"], "responses": ["The documents required for immigration check depend on the destination country and your nationality. Generally, you need a valid passport and visa if required. Some countries may also require additional documents such as a return ticket or proof of accommodation.", "The rules for immigration check at the destination country vary depending on the country's immigration policies. Some countries have strict immigration policies while others have more relaxed policies. It's important to research and understand the immigration policies of your destination country before traveling.", "The procedure for immigration check at the airport involves presenting your passport and any other required documents to the immigration officer. The officer may ask you questions about your trip and purpose of travel.", "Yes, you can be denied entry to a country during immigration check if you do not meet the immigration requirements of that country or if the immigration officer suspects that you have fraudulent intentions.", "The penalties for violating immigration rules vary depending on the country and the severity of the violation. Penalties can range from fines to imprisonment, deportation, or being barred from entering the country again."]}, {
        "tag": "customs_check", "patterns": ["What items are prohibited to carry during customs check?", "What is the procedure for customs check at the airport?", "Can I carry food items during customs check?", "What are the duties and taxes applicable during customs check?", "What are the penalties for violating customs rules?"], "responses": ["Some items that are generally prohibited to carry during customs check include illegal drugs, weapons, and items that violate intellectual property rights such as counterfeit goods.", "The procedure for customs check at the airport involves presenting your baggage to the customs officer for inspection. The officer may ask you questions about the items you are carrying and may request to search your baggage.", "Yes, you can carry food items during customs check, but certain food items may be restricted or prohibited depending on the destination country's regulations.", "The duties and taxes applicable during customs check vary depending on the destination country's customs policies and the value of the items you are carrying.", "The penalties for violating customs rules vary depending on the country and the severity of the violation. Penalties can range from fines to imprisonment, confiscation of the item, or being barred from entering the country again."]}, {
        "tag": "security_check", "patterns": ["What items are not allowed in my carry-on luggage during security check?", "Can I bring liquids in my carry-on bag through security check?", "How much time should I allow for security check before my flight?", "What happens if I set off the metal detector during security check?", "How can I request special assistance during security check if I have a disability?"], "responses": ["Items such as firearms, explosives, and sharp objects are generally not allowed in carry-on luggage during security check. It's important to check the specific regulations of your airline and destination country before traveling.", "Liquids can be brought in carry-on bags through security check, but they must be in containers that are 3.4 ounces or less and placed in a clear, plastic, quart-sized bag.", "It's recommended that you allow at least two hours before your flight for security check procedures.", "If you set off the metal detector during security check, you may be subjected to additional screening such as a pat-down or a full-body scanner.", "If you have a disability or require special assistance during security check, you can inform the security officer or your airline in advance. You may be provided with assistance such as a wheelchair or a private screening area."]}, {
        "tag": "check-in_enquiry", "patterns": ["What are the check-in options available for my flight?", "Can I check in online or through a mobile app?", "Is it possible to check in at the airport? What are the check-in counter timings?", "Can I use self-service check-in kiosks at the airport?", "What documents are required for check-in?"], "responses": ["The check-in options for your flight depend on the airline and the type of ticket you have purchased. Most airlines offer online or mobile check-in, as well as check-in at the airport.", "Yes, you can usually check in online or through a mobile app.", "Yes, you can check in at the airport. The check-in counter timings vary by airline, so it's best to check with the airline directly.", "Yes, many airports have self-service check-in kiosks available for use by passengers.", "You will typically need a government-issued ID, such as a passport or driver's license, as well as your flight ticket or confirmation number."]}, {
        "tag": "boarding_pass_enquiry", "patterns": ["How can I obtain my boarding pass?", "Can I receive my boarding pass through email or SMS?", "Is it possible to print my boarding pass at the airport?", "How early can I get my boarding pass before the flight departure?", "What information does my boarding pass contain?"], "responses": ["You can usually obtain your boarding pass through online check-in or mobile app.", "Yes, some airlines offer the option to receive your boarding pass through email or SMS.", "Yes, you can usually print your boarding pass at the airport.", "You can usually get your boarding pass within 24 hours of your flight departure time.", "Your boarding pass contains your flight details, seat assignment, and boarding group."]}, {
        "tag": "in-flight_entertainment", "patterns": ["What kind of in-flight entertainment options are available on my flight?", "Is there any fee for using the in-flight entertainment system?", "Can I bring my own device to watch movies or TV shows during the flight?", "Is there Wi-Fi available on the flight?", "How can I access the in-flight entertainment system?"], "responses": ["In-flight entertainment options vary by airline and aircraft type, but may include movies, TV shows, music, and games.", "Some airlines charge a fee for in-flight entertainment, while others offer it for free.", "Yes, you can bring your own device to watch movies or TV shows during the flight, but you may need to download the airline's app or software to access the content.", "Yes, some airlines offer Wi-Fi on the flight for a fee.", "The in-flight entertainment system is typically accessed through the seatback screen or personal device."]}, {
        "tag": "meal_options", "patterns": ["What meal options are available on my flight?", "How can I select my meal preference?", "Is there a vegetarian or vegan meal option available?", "Can I make changes to my meal selection?", "Is there any additional charge for meals on the flight?"], "responses": ["Meal options vary by airline and flight duration, but may include options for breakfast, lunch, dinner, and snacks.", "You can usually select your meal preference during the booking process or through the airline's website or mobile app.", "Yes, many airlines offer vegetarian or vegan meal options.", "You may be able to make changes to your meal selection by contacting the airline directly.", "Some airlines charge an additional fee for meals on the flight."]}, {
        "tag": "alcohol_policy", "patterns": ["What is the alcohol policy on the flight?", "How much alcohol am I allowed to bring onboard?", "Is there an age restriction for alcohol consumption on the flight?", "Can I purchase alcohol on the flight?", "What are the consequences of violating the alcohol policy on the flight?"], "responses": ["The alcohol policy on the flight varies by airline and flight duration.", "You may be allowed to bring a limited amount of alcohol onboard, but it must be in its original, unopened container.", "Yes, there is usually an age restriction for alcohol consumption on the flight.", "Yes, you can usually purchase alcohol on the flight, but the options and availability may vary.", "Violating the alcohol policy on the flight may result in consequences such as being denied boarding or removed from the flight."]}, {
        "tag": "cabin_luggage_policy", "patterns": ["What is the cabin luggage policy for my flight?", "What are the size and weight restrictions for cabin luggage?", "How many pieces of cabin luggage am I allowed to carry?", "Can I bring a backpack or purse onboard in addition to my cabin luggage?", "What items are not allowed in the cabin luggage?"], "responses": ["The cabin luggage policy for your flight depends on the airline and the type of ticket you have purchased.", "There are usually size and weight restrictions for cabin luggage, which may vary by airline.", "The number of pieces of cabin luggage you are allowed to carry also varies by airline and ticket type.", "Yes, you can usually bring a backpack or purse onboard in addition to your cabin luggage, but this also depends on the airline.", "Items such as weapons, sharp objects, and flammable materials are generally not allowed in the cabin luggage."]}, {
        "tag": "carry-on_policy", "patterns": ["What is the carry-on policy for my flight?", "What are the size and weight restrictions for carry-on baggage?", "How many pieces of carry-on baggage am I allowed to bring?", "Can I bring a laptop or camera as carry-on baggage?", "What items are not allowed in the carry-on baggage?"], "responses": ["The carry-on policy for your flight depends on the airline and the type of ticket you have purchased.", "There are usually size and weight restrictions for carry-on baggage, which may vary by airline.", "The number of pieces of carry-on baggage you are allowed to bring also varies by airline and ticket type.", "Yes, you can usually bring a laptop or camera as carry-on baggage, but this also depends on the airline.", "Items such as weapons, sharp objects, and flammable materials are generally not allowed in the carry-on baggage."]}, {
        "tag": "check-in_policy", "patterns": ["What is the check-in policy for my flight?", "How early do I need to arrive at the airport before the flight departure?", "Is there a cut-off time for check-in at the airport?", "What documents do I need to bring for check-in?", "What happens if I miss my flight check-in deadline?"], "responses": ["The check-in policy for your flight may vary based on the airline and type of ticket you have purchased.", "Generally, it is recommended to arrive at the airport at least 2-3 hours before the flight departure time for international flights and 1-2 hours for domestic flights. ", "There is usually a cut-off time for check-in at the airport, which can be anywhere from 30 minutes to 2 hours before the flight departure time. You will need to bring your valid passport or ID along with your flight ticket for check-in.", "For check in we requried passport,visa,flight ticket", "If you miss your flight check-in deadline, you may not be allowed to board the flight and could potentially forfeit your ticket."]}, {
        "tag": "boarding_policy", "patterns": ["What is the boarding policy for my flight?", "How early do I need to be at the boarding gate before the flight departure?", "Can I request a priority boarding pass?", "What happens if I miss my boarding time?", "How are the boarding groups and procedures organized?"], "responses": ["The boarding policy for your flight may vary based on the airline and type of ticket you have purchased.", "Generally, it is recommended to be at the boarding gate at least 30-60 minutes before the flight departure time.", "Priority boarding passes are often available for purchase or can be obtained by meeting certain eligibility criteria, such as being a frequent flyer member or having a certain type of ticket", "If you miss your boarding time, you may not be allowed to board the flight and could potentially forfeit your ticket. Boarding groups and procedures are typically organized by zones or groups based on ticket type, status, or eligibility.", "Airlines often divide passengers into groups based on factors such as fare class, frequent flyer status, and seat location. Each group is assigned a boarding number or letter, and passengers board the plane in numerical or alphabetical order."]}, {
        "tag": "flight_attendant_assistance", "patterns": ["Can I request any assistance from the flight attendants during the flight?", "How can I request special assistance for medical or mobility issues?", "What assistance is available for families with infants or children?", "Can I ask for a blanket or pillow during the flight?", "How can I report any issues or concerns to the flight attendants?"], "responses": ["You can request assistance from the flight attendants during the flight for a variety of reasons, such as requesting food or drinks, help with baggage, or assistance with medical or mobility issues", "To request special assistance for medical or mobility issues, you should contact the airline before your flight to make arrangements. Assistance for families with infants or children may include things like providing baby food or formula, a bassinet or special seat, or entertainment options for children.", "You can ask for a blanket or pillow during the flight, and if you have any issues or concerns, you can report them to the flight attendants who will try to address them as best as they can.", "yes,you can have blancket and pillow", "you can ask for flight assistant"]}, {
        "tag": "seat_upgrade_enquiry", "patterns": ["How can I upgrade my seat?", "How much does it cost to upgrade my seat?", "Can I use my frequent flyer miles to upgrade my seat?", "Is there any availability for an upgrade on my upcoming flight?", "What benefits come with an upgraded seat?"], "responses": ["To upgrade your seat, you can check with the airline's website or customer service for available options and prices.", "The cost of upgrading your seat can vary depending on the airline, route, and seat type.", "Some airlines allow you to use frequent flyer miles to upgrade your seat. You can check with the airline's loyalty program for more information.", "The availability of upgrades depends on the airline's policies and seat availability on your specific flight.", "Upgrading your seat can come with benefits such as extra legroom, priority boarding, and in-flight amenities."]}, {
        "tag": "aircraft_type_enquiry", "patterns": ["What type of aircraft will I be flying on?", "How many seats are on this aircraft?", "What is the seating arrangement on this aircraft?", "Does this aircraft have Wi-Fi or in-flight entertainment?", "Are there any special features of this aircraft?"], "responses": ["You can find out the type of aircraft you will be flying on by checking your booking confirmation or the airline's website.", "The number of seats on the aircraft can vary depending on the model and airline configuration.", "The seating arrangement can also vary depending on the aircraft and airline.", "Some aircraft have Wi-Fi or in-flight entertainment, while others may not. You can check with the airline for more information.", "Some aircraft may have special features such as larger windows or more comfortable seating."]}, {
        "tag": "on-time_performance", "patterns": ["Is my flight on time?", "What is the status of my flight?", "Has my flight been delayed or canceled?", "When will my flight arrive?", "What is the average delay time for flights departing from this airport?"], "responses": ["You can check the status of your flight and whether it's on time by checking the airline's website or contacting customer service.", "If your flight has been delayed or canceled, the airline will typically notify you and provide information on your options.", "The average delay time for flights departing from an airport can vary depending on many factors such as weather conditions and air traffic.", "you will notified through email", "The average delay time is 30 mins"]}, {
        "tag": "airport_facilities", "patterns": ["What facilities are available at the airport?", "Is there a lounge at the airport that I can access?", "Are there any restaurants or shops in the airport?", "Can I rent a car from the airport?", "Is there a currency exchange at the airport?"], "responses": ["The facilities available at the airport can vary depending on the airport and location.", "Some airports may have lounges that you can access either through airline loyalty programs or by paying a fee.", "Most airports have restaurants and shops available for passengers.", "You can usually rent a car at the airport, and there may be public transportation options available as well.", "Many airports have currency exchange services available."]}, {
        "tag": "lounge_access", "patterns": ["Can I access the lounge at this airport?", "What are the benefits of accessing the lounge?", "How much does it cost to access the lounge?", "Are there any restrictions on accessing the lounge?", "Is there food and drink available in the lounge?"], "responses": ["Whether or not you can access the lounge at an airport depends on the airport and the airline's policies.", "Accessing the lounge can come with benefits such as free food and drinks, comfortable seating, and access to Wi-Fi and other amenities.", "The cost of accessing the lounge can vary depending on the airline and the airport.", "There may be restrictions on accessing the lounge such as eligibility based on frequent flyer status or travel class.", "Food and drinks are usually available in the lounge."]}, {
        "tag": "ground_transportation", "patterns": ["What ground transportation options are available at the airport?", "How do I get from the airport to my hotel?", "Is there a shuttle service available at the airport?", "Can I rent a car at the airport?", "Are there any public transportation options available?"], "responses": ["The ground transportation options available at the airport can vary depending on the airport and location.", "You can usually find information on ground transportation options on the airport's website or by contacting customer service.", "Options may include shuttle services, public transportation, or car rentals.", "yes,you can take a car in airport", "yes,you can take taxi in the airport"]}, {
        "tag": "flight_connection", "patterns": ["How much time do I need for my flight connection?", "Will my bags be transferred automatically to my connecting flight?", "Will I need to go through security again for my connecting flight?", "Will I need to change terminals for my connecting flight?", "What happens if I miss my connecting flight?"], "responses": ["The amount of time you need for your flight connection can vary depending on the airport and airline policies.", "Your bags may be transferred automatically to your connecting flight, but you should check with the airline to confirm.", "You may need to go through security again for your connecting flight, depending on the airport.", "If you need to change terminals for your connecting flight, the airline will typically provide instructions.", "If you miss your connecting flight, the airline will typically provide information on your options."]}, {
        "tag": "layover_enquiry", "patterns": ["How long is my layover?", "What can I do during my layover?", "Are there any nearby attractions that I can visit during my layover?", "Is there a lounge that I can access during my layover?", "Can I leave the airport during my layover?"], "responses": ["The length of your layover depends on your flight itinerary and can vary depending on the airline and route.", "Enjoy the lounge facilities, Check out the airport area, Read a book, Take a nap.", "You can usually find information on airport amenities and nearby attractions on the airport's website", "Some airports may have lounges that you can access during your layover.", "You may be able to leave the airport during your layover, but you should check with the airline for any visa or entry requirements."]}, {
        "tag": "rebooking_assistance", "patterns": ["Can you help me rebook my flight?", "How much will it cost to rebook my flight?", "What are my options for rebooking my flight?", "Can I rebook my flight online or do I need to call customer service?", "Is there a deadline for rebooking my flight?"], "responses": ["Yes, we can definitely help you rebook your flight.", "The cost of rebooking your flight will depend on various factors such as the fare rules of your ticket and the availability of seats on alternative flights.", "Your options for rebooking your flight may include changing the date or time of your flight, routing, or class of service.", "You can rebook your flight online or by calling our customer service center.", "The deadline for rebooking your flight may depend on the fare rules of your ticket."]}, {
        "tag": "flight_review", "patterns": ["Can I leave a review of my flight?", "Where can I leave a review of my flight?", "What should I include in my review of the flight?", "Will the airline respond to my review?", "Will my review affect my future experiences with the airline?"], "responses": ["Yes, you can leave a review of your flight.", "You can leave a review of your flight on various platforms such as the airline's website, social media channels, or third-party review websites.", "In your review of the flight, you can include details about your overall experience, the service provided by the airline staff, the quality of the food and beverages, the cleanliness and comfort of the cabin, etc.", "The airline may respond to your review if you leave it on their website or social media channels.", "Your review may not directly affect your future experiences with the airline, but it may provide valuable feedback for the airline to improve its services."]}, {
        "tag": "flight_complaints", "patterns": ["How can I file a complaint about my recent flight?", "My flight was delayed/cancelled, what compensation am I entitled to?", "My luggage was lost/damaged during the flight, what should I do?", "I had a bad experience with the flight crew, how can I report it?"], "responses": ["To file a complaint about a recent flight, contact the airline's customer service department through their website, phone or email.", "If your flight was delayed or cancelled, you may be entitled to compensation depending on the circumstances. Contact the airline's customer service department for more information.", "If your luggage was lost or damaged during the flight, report it to the airline's baggage services office before leaving the airport.", "To report a bad experience with the flight crew, contact the airline's customer service department and provide specific details."]}, {
        "tag": "flight_compliments", "patterns": ["How can I send a compliment to the airline for a good flight experience?", "I had a great flight with your airline, who can I tell about it?", "What is the best way to express my appreciation for the excellent service provided by the flight crew?", "Can I give a shout-out to the pilot for a smooth flight?"], "responses": ["To send a compliment to the airline for a good flight experience, you can contact the airline's customer support team via phone, email, or social media.", "If you had a great flight with the airline, you can share your experience on social media or write a review on the airline's website.", "To express your appreciation for the excellent service provided by the flight crew, you can leave a note for the crew or contact the airline's customer support team.", "no worries, the pilot is well tarined for handling all the circumstances."]}, {
        "tag": "in-flight_announcements", "patterns": ["What kind of in-flight announcements can I expect during my flight?", "How often will the flight crew make announcements during the flight?", "What languages will in-flight announcements be made in?", "What should I do if I cannot understand the in-flight announcements?"], "responses": ["During your flight, you can expect in-flight announcements regarding safety instructions, meal service, and other relevant information.", "The frequency of in-flight announcements varies depending on the airline and the length of the flight.", "In-flight announcements are typically made in the language spoken by the majority of the passengers on board.", "If you cannot understand the in-flight announcements, you can ask a flight attendant for assistance."]}, {
        "tag": "flight_safety_instructions", "patterns": ["When will the flight safety instructions be given?", "What should I do if I have questions about the safety instructions?", "What are the emergency procedures in case of an emergency?", "Can I bring my own safety equipment on board?"], "responses": ["Flight safety instructions will be given at the beginning of the flight or during the pre-takeoff safety briefing.", "If you have questions about the safety instructions, you can ask a flight attendant for clarification.", "In case of an emergency, the flight crew will provide instructions on emergency procedures and evacuation.", "You are not allowed to bring your own safety equipment on board."]}, {
        "tag": "turbulence_information", "patterns": ["What causes turbulence during a flight?", "How common is turbulence during flights?", "How can I stay safe during turbulence?", "Can the flight crew predict turbulence and take measures to avoid it?"], "responses": ["Turbulence during a flight is caused by a variety of factors, including weather conditions and air currents.", "Turbulence is a common occurrence during flights and is usually not a cause for concern.", "To stay safe during turbulence, ensure that your seat belt is securely fastened at all times and follow any instructions given by the flight crew.", "The flight crew can predict turbulence to some extent and take measures to avoid it, but it cannot always be avoided."]}, {
        "tag": "air_sickness_enquiry", "patterns": ["What can I do if I start feeling air sick during the flight?", "Are there any medications or remedies for air sickness?", "Can I request a seat in a certain part of the plane to avoid feeling air sick?", "Is air sickness a serious medical condition?"], "responses": ["If you start feeling air sick during the flight, you can ask a flight attendant for assistance and they may be able to provide you with medication or other remedies.", "There are various medications and remedies available for air sickness, such as motion sickness pills and acupressure bands.", "You can request a seat in a certain part of the plane, such as over the wings, to minimize the effects of air sickness.", "Air sickness is typically not a serious medical condition, but it can be uncomfortable."]}, {
        "tag": "oxygen_enquiry", "patterns": ["Can I bring my own oxygen on board?", "Will the airline provide oxygen for me during the flight?", "How do I request oxygen during the flight?", "Are there any restrictions on the use of oxygen on board?"], "responses": ["If you need to bring your own oxygen on board, you will need to contact the airline before your flight to make arrangements.", "Most airlines provide oxygen for passengers who need it during the flight, but it is best to check with the airline before you travel.", "To request oxygen during the flight, you can speak to a flight attendant who will assist you with the process.", "There are restrictions on the use of oxygen on board, and passengers may be required to provide medical documentation or complete a medical form before being allowed to use oxygen during the flight."]}, {
        "tag": "medical_emergency_response", "patterns": ["What should I do if I or someone else has a medical emergency on board?", "Is there a doctor or medical professional on board the flight?", "Are there any medical supplies on board the flight?", "Will the airline assist with medical emergencies that occur before or after the flight?"], "responses": ["If you or someone else has a medical emergency on board, you should immediately notify a flight attendant for assistance.", "There may be a doctor or medical professional on board the flight, but this is not guaranteed.", "Most airlines carry basic medical supplies on board the flight.", "The airline will assist with medical emergencies that occur during the flight, but may not be able to provide assistance for medical emergencies that occur before or after the flight."]}, {
        "tag": "lost_and_found_enquiry", "patterns": ["What should I do if I lost something on the flight?", "How can I track down lost items from a flight?", "What is the process for reporting lost items to the airline?", "How long does it take for lost items to be returned to their owners?"], "responses": ["If you lost something on the flight, report it to the airline's lost and found department.", "You can track down lost items from a flight by contacting the airline's lost and found department or checking their website.", "The process for reporting lost items to the airline varies by airline.", "It may take some time for lost items to be returned to their owners, depending on the circumstances."]}, {
        "tag": "damaged_property_enquiry", "patterns": ["How do I report damaged property after my flight?", "What is the process for filing a claim for damaged luggage?", "Can I get compensation for a damaged laptop during my flight?", "What documentation do I need to provide for a damaged property claim?", "How long does it take to receive a response for a damaged property claim?"], "responses": ["To report damaged property after your flight, you should notify the airline's customer support team as soon as possible.", "The process for filing a claim for damaged luggage typically involves filling out a form and providing documentation such as the baggage claim ticket, photos of the damage, and proof of purchase.", "Compensation for a damaged laptop during a flight may be possible, but it depends on the airline's policies and the circumstances of the damage.", "Documentation that may be required for a damaged property claim includes the baggage claim ticket, photos of the damage, proof of purchase, and any other relevant information.", "The time it takes to receive a response for a damaged property claim can vary depending on the airline's policies and the complexity of the case."]}, {
        "tag": "customer_feedback", "patterns": ["How can I leave feedback about my recent flight?", "Is there a survey I can take to provide feedback on my experience?", "How can I share a compliment or complaint about a specific staff member?", "What is the process for submitting feedback to the airline?", "Will my feedback be taken into consideration for future improvements?"], "responses": ["You can leave feedback about your recent flight by contacting the airline's customer support team or filling out a feedback form on the airline's website.", "Some airlines may also offer surveys for customers to provide feedback on their experience.", "To share a compliment or complaint about a specific staff member, you can contact the airline's customer support team or fill out a feedback form on the airline's website.", "The process for submitting feedback to the airline may involve filling out a form or contacting customer support.", "Feedback from customers is typically taken into consideration for future improvements and to ensure better customer service."]}, {
        "tag": "customer_support", "patterns": ["What are the hours of customer support for the airline?", "How can I contact customer support for the airline?", "Can I request special assistance through customer support?", "Is there a dedicated phone line for customer support for loyalty program members?", "What types of issues can customer support help me with?"], "responses": ["The hours of customer support for the airline may vary depending on the airline and their policies.", "You can contact customer support for the airline by phone, email, or through their website.", "Special assistance can often be requested through customer support.", "Some airlines may have a dedicated phone line for customer support for loyalty program members.", "Customer support can help with a wide range of issues including booking assistance, baggage inquiries, and flight changes."]}, {
        "tag": "website_support", "patterns": ["How do I reset my password for the airline's website?", "Why can't I access my booking on the airline's website?", "How can I book a flight on the airline's website?", "Is there a chat function available on the airline's website for support?", "What should I do if I am experiencing technical difficulties on the airline's website?"], "responses": ["To reset your password for the airline's website, you should follow the prompts on the login page or contact customer support.", "If you can't access your booking on the airline's website, you may need to contact customer support for assistance.", "To book a flight on the airline's website, you can search for flights and follow the prompts to complete the booking process.", "Some airlines may have a chat function available on their website for support.", "If you are experiencing technical difficulties on the airline's website, you should contact customer support for assistance."]}, {
        "tag": "mobile_app_support", "patterns": ["How do I download the airline's mobile app?", "What features are available on the airline's mobile app?", "Is there a separate app for loyalty program members?", "Can I check in for my flight using the mobile app?", "How can I provide feedback on the airline's mobile app?"], "responses": ["To download the airline's mobile app, you can search for it in your device's app store.", "Features available on the airline's mobile app may include booking assistance, flight tracking, and special offers.", "Some airlines may have a separate app for loyalty program members.", "You may be able to check in for your flight using the mobile app.", "To provide feedback on the airline's mobile app, you can contact customer support or leave a review in the app store."]}, {
        "tag": "social_media_support", "patterns": ["Is there a dedicated social media account for customer support for the airline?", "How quickly can I expect a response from the airline's social media team?", "Can I use social media to book a flight or make changes to my booking?", "What types of issues can be resolved through social media support?", "Is there a chat function available on the airline's social media accounts for support?"], "responses": ["To download the airline's mobile app, you can search for it in your device's app store.", "Features available on the airline's mobile app may include booking assistance, flight tracking, and special offers.", "Some airlines may have a separate app for loyalty program members.", "You may be able to check in for your flight using the mobile app.", "To provide feedback on the airline's mobile app, you can contact customer support or leave a review in the app store."]}, {
        "tag": "loyalty_program_enquiry", "patterns": ["How do I enroll in the airline's loyalty program?", "What benefits are available to members of the loyalty program?", "How can I earn points or miles through the loyalty program?", "Can I redeem points or miles for flights or other rewards?", "Is there a cost to join the loyalty program?"], "responses": ["Some airlines may have a dedicated social media account for customer support.", "Response time from the airline's social media team may vary depending on their policies and the volume of inquiries.", "Social media is typically not used for booking flights or making changes to bookings.", "Issues that can be resolved through social media support may include general inquiries, feedback, and customer service issues.", "Some airlines may have a chat function available on their social media accounts for support."]}, {
        "tag": "reward_redemption", "patterns": ["How can I redeem my loyalty program points or miles for a flight?", "Are there any blackout dates or restrictions for reward redemption?", "Can I use my points or miles to upgrade my seat or cabin class?", "How can I track my points or miles balance?", "Are there any expiration dates for my points or miles?"], "responses": ["To redeem loyalty program points or miles for a flight, you can typically do so through the airline's website or mobile app.", "There may be blackout dates or other restrictions on reward redemption, so it's important to check the program terms and conditions.", "Points or miles can often be used to upgrade your seat or cabin class, but again, this is subject to program rules and availability.", "You can usually track your points or miles balance through the airline's website or mobile app.", "Points or miles may have expiration dates, so it's important to check the program terms and conditions to ensure you use them before they expire."]}, {
        "tag": "loyalty_tier_upgrades", "patterns": ["How can I qualify for an upgrade in my loyalty tier?", "What benefits are available at each tier of the loyalty program?", "How long does it take to move up to the next tier in the loyalty program?", "Can I request a one-time upgrade to a higher tier?", "Is there a limit to how high I can advance in the loyalty program?"], "responses": ["To qualify for an upgrade in your loyalty tier, you usually need to earn a certain amount of points or miles within a specific period.", "The benefits available at each tier of the loyalty program can vary, but typically include perks such as priority boarding, lounge access, free checked bags, and bonus points/miles.", "The time it takes to move up to the next tier in the loyalty program depends on how often you fly with the airline and how many points/miles you earn.", "Requesting a one-time upgrade to a higher tier is generally not possible, but some airlines may offer promotions or opportunities to earn bonus points/miles for a limited time.", "There is usually a limit to how high you can advance in the loyalty program, which is typically the highest tier available."]}, {
        "tag": "partner_airlines", "patterns": ["Which airlines are partners with the airline?", "How can I earn loyalty program points or miles on partner airlines?", "Can I book a flight with a partner airline using my loyalty program points or miles?", "Are there any restrictions or limitations when booking with partner airlines?", "Can I receive benefits from the loyalty program when flying with a partner airline?"], "responses": ["The specific airlines that are partners with the airline can vary, but most airlines have partnerships with other carriers. some of our partners include indian airlines, deccan airlines etc...", "To earn loyalty program points or miles on partner airlines, you usually need to book your flight with the airline's partner code and provide your loyalty program information at the time of booking.", "You may be able to book a flight with a partner airline using your loyalty program points or miles, but restrictions and limitations can vary depending on the airline and the specific partner program.", "There may be restrictions or limitations when booking with partner airlines, such as blackout dates, limited availability of award seats, and different redemption rates for partner flights.", "You may be able to receive benefits from the loyalty program when flying with a partner airline, such as priority boarding, lounge access, and extra baggage allowance, but these benefits can vary depending on the airline and the specific partner program."]}, {
        "tag": "flight_schedule_enquiry", "patterns": ["What is the schedule for the next available flight from New York to Los Angeles?", "Can you give me the departure and arrival times for flights between London and Paris?", "How do I check the flight schedule for a specific airline on a particular date?", "What are the flight schedules for the upcoming holiday season?", "Is there a way to receive notifications if there are changes to my flight schedule?"], "responses": ["To check the schedule of the next available flight from one city to another, the customer can visit the airline's website or contact the customer service helpline.", "To know the departure and arrival times for flights between two cities, the customer can use the flight search option on the airline's website or contact the customer service helpline.", "The flight schedule for a specific airline on a particular date can be checked by visiting the airline's website or contacting their customer service helpline.", "The flight schedules for the upcoming holiday season can be checked by visiting the airline's website or contacting their customer service helpline.", "Airlines often provide notifications via email, text message or app if there are changes to the flight schedule. Customers can opt-in to receive such notifications."]}, {
        "tag": "flight_map_information", "patterns": ["Can you show me a map of the flight path from New York to Tokyo?", "How can I find out which cities a particular airline flies to?", "Where can I find information about in-flight maps and entertainment systems?", "Is there a way to track the progress of my flight on a map in real-time?", "What are some popular flight routes that have scenic views?"], "responses": ["The flight path from one city to another can be viewed on the airline's website or on a third-party website that provides such information.", "The cities that a particular airline flies to can be checked on the airline's website or by contacting their customer service helpline.", "Information about in-flight maps and entertainment systems can be found on the airline's website or by contacting their customer service helpline.", "The progress of a flight on a map in real-time can be tracked using the airline's website or a third-party website that provides such information.", "Popular flight routes that have scenic views can be searched online or through the airline's website."]}, {
        "tag": "flight_history_information", "patterns": ["How can I find out the on-time performance history of a particular flight?", "What are the flight routes with the most delays?", "Can you give me information about a flight that was delayed or cancelled last month?", "How do I find out the average flight time for a particular route?", "Can you provide me with information on the safety record of an airline?"], "responses": ["The on-time performance history of a particular flight can be checked on the airline's website or on a third-party website that provides such information.", "The flight routes with the most delays can be checked on the airline's website or on a third-party website that provides such information.", "Information about a delayed or cancelled flight can be obtained from the airline's website or by contacting their customer service helpline.", "The average flight time for a particular route can be checked on the airline's website or on a third-party website that provides such information.", "Information about an airline's safety record can be obtained from regulatory bodies that monitor airline safety."]}, {
        "tag": "airport_codes_enquiry", "patterns": ["What is the three-letter code for JFK International Airport?", "Can you tell me which airport code corresponds to London Heathrow?", "How can I find out the airport code for a specific city?", "Is there a way to search for flights by airport code?", "What are the airport codes for the major airports in Australia?"], "responses": ["The three-letter code for an airport can be found on the airport's website or by searching for the airport code online.", "The airport code for a specific airport can be found on the airport's website or by searching for the airport code online.", "The airport code for a specific city can be found on the airport's website or by searching for the airport code online.", "Flights can be searched by airport code on the airline's website or on a third-party website that provides such information.", "The airport codes for major airports in a particular country can be found on the country's aviation authority website."]}, {
        "tag": "airport_navigation", "patterns": ["How can I find my way to a specific gate in the airport?", "Can you give me directions to the baggage claim area?", "Where can I find the nearest restroom from my current location?", "Is there a way to locate restaurants and shops within the airport?", "How can I find the location of the rental car desks in the airport?"], "responses": ["To navigate your way around the airport, you can check the airport's website or mobile app for a terminal map. ", "Some airports also have information kiosks and customer service desks where you can get directions. ", "You can also follow signs posted throughout the airport to find your way", "You can locate restaurants and shops within the airport by checking the airport's directory or by using their mobile app.", "You can find the location of the rental car desks in the airport by following the signs or by checking the airport's website."]}, {
        "tag": "airport_layout_enquiry", "patterns": ["Can you provide me with a map of the terminal layout at JFK International Airport?", "How can I find the location of the check-in counters for my airline?", "What is the layout of the security checkpoints in the airport?", "Is there a way to find out where the duty-free shops are located?", "Where can I find the lounges available in the airport?"], "responses": ["You can find a map of the terminal layout on the airport's website or mobile app.", " You can also find the location of the check-in counters for your airline by checking the airport's directory or by asking for directions from a customer service representative. ", "The layout of the security checkpoints in the airport is typically posted on the airport's website or mobile app.", "You can find out where the duty-free shops are located by checking the airport's directory or mobile app. ", "The lounges available in the airport can be found by checking the airport's website or mobile app, or by asking for directions from a customer service representative."]}, {
        "tag": "ground_staff_assistance", "patterns": ["How can I request wheelchair assistance for my elderly relative?", "Can you help me with my luggage from the baggage claim area to my car rental?", "How can I request assistance with my connecting flight if I have a tight layover time?", "Is there a way to arrange for a ground staff member to escort me through the airport?", "Can you help me find a lost item in the airport?"], "responses": ["To request wheelchair assistance or any other ground staff assistance, you can contact the airline's customer support or make the request when you check in at the airport.", "The airline's ground staff can assist you with your luggage from the baggage claim area to your car rental, or with any other assistance you require.", "If you have a tight layover time and need assistance with your connecting flight, you can request assistance from the airline's customer support or a customer service representative at the airport. ", "yes, on special permission you are granted a customer representative to escort you through the airport.", " If you lose an item in the airport, you can report it to the lost and found department or customer service representative."]}, {
        "tag": "customer_rights_enquiry", "patterns": ["What are my rights as a passenger in case of flight cancellations or delays?", "How can I claim compensation for lost or damaged baggage?", "Can you provide me with information on the airline's policy for overbooking flights?", "What are my options if I miss my flight due to circumstances beyond my control?", "Can you give me information on the airline's policy for changing or cancelling a flight reservation?"], "responses": ["As a passenger, you have rights in case of flight cancellations or delays, which may include compensation, rebooking on another flight, or a refund of your ticket price. The specific rights and remedies may vary depending on the airline and the country you are traveling in.", "You can claim compensation for lost or damaged baggage by filing a claim with the airline within a specified timeframe. The compensation amount may depend on the type of baggage, the value of the lost or damaged items, and the airline's policy.", "Airlines may have their own policies for overbooking flights, but generally, if a flight is overbooked and you are denied boarding, the airline must provide you with compensation and offer you the option to rebook on a later flight.", "If you miss your flight due to circumstances beyond your control, such as a delayed connecting flight, the airline may offer you the option to rebook on a later flight at no additional charge.", "Airlines may have different policies for changing or canceling a flight reservation, which may include fees or penalties. It is important to check the airline's policy before making any changes to your reservation."]}, {
        "tag": "legal_information", "patterns": ["What are the rules and regulations regarding carry-on baggage on flights?", "Can you give me information on the legal age for travelling alone on a flight?", "What are the procedures for customs and immigration when travelling internationally?", "Is there a way to find out the legal requirements for travelling with a pet on a flight?", "How can I find out the airline's policy on smoking and alcohol consumption"], "responses": ["The rules and regulations regarding carry-on baggage on flights may vary depending on the airline and the country you are traveling in. Generally, passengers are allowed to bring one carry-on bag and one personal item on board, subject to size and weight restrictions.", "The legal age for traveling alone on a flight may vary depending on the airline and the country you are traveling in. Generally, children under the age of 12 must be accompanied by an adult.", "The procedures for customs and immigration when traveling internationally may vary depending on the country you are traveling to and from. Generally, you will be required to complete immigration and customs forms, have your passport and visa (if required) checked, and go through security screenings.", "The legal requirements for traveling with a pet on a flight may vary depending on the airline and the country you are traveling in. Generally, you will need to provide proof of your pet's health and vaccination records, and may be required to purchase a special travel crate for your pet.", "Airlines may have their own policies on smoking and alcohol consumption on flights, which may include restrictions on smoking, limits on alcohol consumption, or a complete ban on alcohol. However our airlines provide you a bottle of Champagne as complimentary, we wish you have fun.."]}, {
        "tag": "terms_of_service", "patterns": ["What are the terms and conditions for purchasing a flight ticket?", "Is there a way to review the airline's policy on changes to flight reservations?", "How can I find out the airline's policy on baggage allowance?", "Can you provide information on the airline's policy for cancelling a flight?", "What are the rules and regulations for travelling with children on a flight?"], "responses": ["Terms and conditions for purchasing a flight ticket vary by airline and can usually be found on the airline's website.", "Airlines generally have policies regarding changes to flight reservations, which can also be found on their website or by contacting customer service.", "Baggage allowances also vary by airline and can be found on their website or by contacting customer service.", "Airlines typically have policies for cancelling a flight, which can be found on their website or by contacting customer service.", "Rules and regulations for travelling with children on a flight vary by airline and can be found on their website or by contacting customer service."]}, {
        "tag": "refunds_and_compensation", "patterns": ["What are the conditions for getting a refund on a flight ticket?", "How can I claim compensation for a flight delay or cancellation?", "Is there a way to request a refund for a flight that I missed due to unforeseen circumstances?", "Can you give me information on the airline's policy for involuntary denied boarding compensation?", "What are my options for compensation if my luggage is lost or damaged during a flight?"], "responses": ["Conditions for getting a refund on a flight ticket vary by airline and can usually be found on the airline's website.", "To claim compensation for a flight delay or cancellation, check the airline's policy on their website or contact customer service.", "To request a refund for a missed flight due to unforeseen circumstances, contact the airline's customer service.", "Involuntary denied boarding compensation policies can vary by airline and can be found on their website or by contacting customer service.", "To claim compensation for lost or damaged luggage during a flight, check the airline's policy on their website or contact customer service."]}, {
        "tag": "baggage_storage_enquiry", "patterns": ["Is there a way to store my luggage at the airport for a few hours?", "How can I find out the cost of storing my luggage at the airport?", "Can you provide me with information on the maximum storage duration for luggage at the airport?", "What are the procedures for picking up my luggage after storage?", "Is there a way to arrange for the storage of oversized or fragile items at the airport?"], "responses": ["Most airports offer luggage storage for a fee. Contact the airport or check their website for more information.", "The cost of luggage storage at the airport can vary depending on the airport and duration of storage. Contact the airport or check their website for more information.", "The maximum storage duration for luggage at the airport can vary depending on the airport. Contact the airport or check their website for more information.", "Procedures for picking up luggage after storage can vary depending on the airport. Contact the airport or check their website for more information.", "Oversized or fragile items can often be stored at the airport for a fee. Contact the airport or check their website for more information."]}, {
        "tag": "bicycle_transportation", "patterns": ["Can I bring my bicycle on the flight as checked baggage?", "What are the procedures for packing and preparing my bicycle for air travel?", "How can I find out the airline's policy on bicycle transportation fees?", "Is there a way to track my bicycle during air travel?", "What are the restrictions on the size and weight of a bicycle for air travel?"], "responses": ["Most airlines allow bicycles as checked baggage, but policies can vary. Check the airline's policy on their website or contact customer service.", "Procedures for packing and preparing a bicycle for air travel can vary by airline. Check the airline's policy on their website or contact customer service.", "Fees for bicycle transportation can vary by airline. Check the airline's policy on their website or contact customer service.", "Most airlines offer tracking services for checked baggage, including bicycles.", "Airlines often have restrictions on the size and weight of bicycles for air travel. Check the airline's policy on their website or contact customer service."]}, {
        "tag": "oversize_luggage_enquiry", "patterns": ["What are the size and weight limits for checked baggage on a flight?", "Can I bring an oversized item as checked baggage?", "How can I find out the airline's policy on oversize baggage fees?", "What are the procedures for checking in oversize baggage at the airport?", "Is there a way to track my oversize baggage during air travel?"], "responses": ["Checked baggage size and weight limits vary by airline and can usually be found on their website or by contacting customer service.", "Oversized items can often be brought as checked baggage, but policies can vary by airline. Check the airline's policy on their website or contact customer service.", "Oversize baggage fees can vary by airline. Check the airline's policy on their website or contact customer service.", "Procedures for checking in oversize baggage can vary by airline. Check the airline's policy on their website or contact customer service.", "Most airlines offer tracking services for checked baggage, including oversize items."]}, {
        "tag": "fragile_item_transportation", "patterns": ["How can I transport fragile items on a flight?", "What are the procedures for packing and preparing my fragile items for air travel?", "Can I purchase additional insurance for my fragile items during air travel?", "How can I find out the airline's policy on fragile item transportation fees?", "What are the restrictions on the size and weight of a fragile item for air travel?"], "responses": ["To transport fragile items on a flight, it's important to properly pack and label them as fragile.", "Procedures for packing and preparing fragile items vary depending on the type of item and airline policies. It's best to check with your airline for specific guidelines.", "Most airlines offer additional insurance for fragile items during air travel, but the cost and coverage will depend on the airline.", "The airline's policy on fragile item transportation fees can usually be found on their website or by contacting their customer service.", "The restrictions on the size and weight of a fragile item for air travel will vary by airline and type of item. It's best to check with your airline for specific guidelines."]}, {
        "tag": "musical_instrument_transportation", "patterns": ["Can I bring my musical instrument on the flight as carry-on or checked baggage?", "What are the procedures for packing and preparing my musical instrument for air travel?", "How can I find out the airline's policy on musical instrument transportation fees?", "Is there a way to track my musical instrument during air travel?", "What are the restrictions on the size and weight of a musical instrument for air travel?"], "responses": ["You may be able to bring your musical instrument on the flight as either carry-on or checked baggage, depending on its size and weight.", "Procedures for packing and preparing musical instruments for air travel will vary depending on the type of instrument and airline policies. It's best to check with your airline for specific guidelines.", "The airline's policy on musical instrument transportation fees can usually be found on their website or by contacting their customer service.", "Most airlines allow for tracking of musical instruments during air travel, but the specifics will depend on the airline.", "The restrictions on the size and weight of a musical instrument for air travel will vary by airline and type of instrument. It's best to check with your airline for specific guidelines."]}, {
        "tag": "sports_equipment_transportation", "patterns": ["Can I bring my musical instrument on the flight as carry-on or checked baggage?", "What are the procedures for packing and preparing my musical instrument for air travel?", "How can I find out the airline's policy on musical instrument transportation fees?", "Is there a way to track my musical instrument during air travel?", "What are the restrictions on the size and weight of a musical instrument for air travel?"], "responses": ["You may be able to bring your sports equipment on the flight as checked baggage, depending on its size and weight.", "Procedures for packing and preparing sports equipment for air travel will vary depending on the type of equipment and airline policies. It's best to check with your airline for specific guidelines.", "The airline's policy on sports equipment transportation fees can usually be found on their website or by contacting their customer service.", "Most airlines allow for tracking of sports equipment during air travel, but the specifics will depend on the airline.", "The restrictions on the size and weight of sports equipment for air travel will vary by airline and type of equipment. It's best to check with your airline for specific guidelines."]}, {
        "tag": "excess_baggage_fees", "patterns": ["How can I find out the cost of excess baggage fees?", "Can I purchase additional baggage allowance for my flight?", "Is there a way to track my excess baggage during air travel?", "What are the restrictions on the size and weight of excess baggage", "how much do I need to pay for excess baggage?"], "responses": ["The cost of excess baggage fees will vary by airline and destination. It's best to check with your airline for specific fees.", "Many airlines allow for the purchase of additional baggage allowance for your flight, but the cost and amount will depend on the airline.", "Most airlines allow for tracking of excess baggage during air travel, but the specifics will depend on the airline.", "The restrictions on the size and weight of excess baggage will vary by airline and destination. It's best to check with your airline for specific guidelines.", "the amount to be paid depends weight of excess baggage and the distance between source and destination. For more information go through our official website."]}, {
        "tag": "cargo_services_enquiry", "patterns": ["What are the available cargo services provided by your airline?", "Can you provide me with the pricing details for cargo services?", "What is the maximum weight limit for cargo shipments?", "What are the requirements for booking cargo services?", "Can you assist me with the customs clearance process for international cargo shipments?"], "responses": ["Our airline provides various cargo services, including standard cargo and express cargo.", "The pricing for cargo services may vary depending on the type of service and weight of the shipment. Please contact our customer service for more details.", "The maximum weight limit for cargo shipments may also vary depending on the type of service. Please contact our customer service for more details.", "To book cargo services, you will need to provide us with the shipment details, including the type of service, weight, and destination.", "We can assist you with the customs clearance process for international cargo shipments."]}, {
        "tag": "freight_enquiry", "patterns": ["What are the different freight options available for shipping goods?", "What is the transit time for freight shipments?", "Can you provide me with the pricing details for freight services?", "What are the requirements for booking freight shipments?", "Can you provide me with information about the insurance options available for freight shipments?"], "responses": ["Our airline offers different freight options, including air freight and sea-air freight.", "The transit time for freight shipments may vary depending on the destination and mode of transportation. Please contact our customer service for more details.", "The pricing for freight services may vary depending on the type of service, weight, and destination. Please contact our customer service for more details.", "To book freight shipments, you will need to provide us with the shipment details, including the type of service, weight, and destination.", "We offer insurance options for freight shipments, and you can contact our customer service for more details."]}, {
        "tag": "charter_flight_enquiry", "patterns": ["What are the different types of charter flights available?", "Can you provide me with a quote for chartering a flight?", "What is the maximum number of passengers that can be accommodated on a charter flight?", "What are the requirements for booking a charter flight?", "Can you assist me with ground transportation arrangements for my charter flight?"], "responses": ["Our airline offers different types of charter flights, including private charters and group charters.", "The quote for chartering a flight may vary depending on the type of aircraft, destination, and duration of the flight. Please contact our customer service for more details.", "The maximum number of passengers that can be accommodated on a charter flight may vary depending on the type of aircraft. Please contact our customer service for more details.", "To book a charter flight, you will need to provide us with the details of your travel, including the destination, number of passengers, and preferred aircraft.", "We can assist you with ground transportation arrangements for your charter flight."]}, {
        "tag": "private_jet_enquiry", "patterns": ["What are the different types of private jets available for hire?", "Can you provide me with a quote for hiring a private jet?", "What is the maximum number of passengers that can be accommodated on a private jet?", "What are the requirements for hiring a private jet?", "Can you assist me with catering and other in-flight services for my private jet?"], "responses": ["Our airline offers different types of private jets for hire, including light jets, midsize jets, and heavy jets.", "The quote for hiring a private jet may vary depending on the type of aircraft, destination, and duration of the flight. Please contact our customer service for more details.", "The maximum number of passengers that can be accommodated on a private jet may vary depending on the type of aircraft. Please contact our customer service for more details.", "To hire a private jet, you will need to provide us with the details of your travel, including the destination, number of passengers, and preferred aircraft.", "We can assist you with catering and other in-flight services for your private jet."]}, {
        "tag": "VIP_services_enquiry", "patterns": ["What are the different types of VIP services provided by your airline?", "Can you provide me with the pricing details for VIP services?", "What are the requirements for booking VIP services?", "Can you assist me with ground transportation arrangements for my VIP service?", "Can you provide me with information about the lounge access options available for VIP passengers?"], "responses": ["Our airline offers different types of VIP services, including priority check-in, lounge access, and personalized services.", "The pricing for VIP services may vary depending on the type of service and destination. Please contact our customer service for more details.", "Please contact our customer service for more details", "To book VIP services, you will need to provide us with the details of your travel, including the destination and type of service.", "We can assist you with ground transportation arrangements for your VIP service and provide you with information about lounge access options."]}, {
        "tag": "airport_security_measures", "patterns": ["What are the security measures in place at the airport?", "Can you provide me with information about the screening process?", "What items are prohibited from being carried in the cabin baggage?", "What should I do if I have a medical condition that requires special attention during the security screening process?", "Can you provide me with information about the security clearance process for international flights?"], "responses": ["The security measures at the airport include baggage screening, metal detection, and body scanning.", "The screening process may vary depending on the type of flight and destination. Please follow the instructions of the security personnel.", "Some items, such as weapons, explosives, and liquids over 100 ml, are prohibited from being carried in the cabin baggage.", "If you have a medical condition that requires special attention during the security screening process, please inform the security personnel in advance.", "The security clearance process for international flights may include additional screening and documentation checks."]}, {
        "tag": "lost_and_found_policy", "patterns": ["What should I do if I lost an item at the airport or on a flight?", "How long do you keep lost items before disposing of them?", "Can you assist me with locating my lost items?", "What is the process for claiming lost items?", "Is there any fee for claiming lost items?"], "responses": ["If you lost an item at the airport or on a flight, please contact the Lost and Found department as soon as possible.", "The length of time items are kept before disposing of them varies, but typically it is around 30-90 days.", "We can assist you in locating your lost item by taking your details and searching our database.", "The process for claiming lost items involves providing identification and proof of ownership for the lost item.", "There may be a fee for claiming lost items depending on the item and the airline's policy."]}, {
        "tag": "airport_parking_enquiry", "patterns": ["What are the parking options available at the airport?", "Can you provide me with information about the pricing for parking services?", "Is there any discount for long-term parking?", "Can I book a parking spot in advance?", "What are the payment options available for parking services?"], "responses": ["We offer a range of parking options at the airport, including short-term and long-term parking.", "Pricing for parking services varies depending on the length of time and the type of parking required.", "There may be discounts available for long-term parking, please check with our customer service team.", "You can book a parking spot in advance through our website or customer service center.", "Payment options for parking services include credit/debit cards, cash and online payment methods."]}, {
        "tag": "car_rental_enquiry", "patterns": ["Do you have a car rental service at the airport?", "Can you provide me with information about the different types of cars available for rent?", "What are the pricing options for car rental services?", "What are the requirements for renting a car?", "Can you assist me with booking a rental car?"], "responses": ["Yes, we offer car rental services at the airport.", "We have a variety of cars available for rent, including economy, mid-size, full-size, SUVs and luxury cars.", "Pricing options for car rental services vary depending on the type of car and the length of rental.", "The requirements for renting a car include a valid driver's license, credit card, and age restrictions may apply.", "We can assist you with booking a rental car through our website or customer service center."]}, {
        "tag": "hotel_reservation_enquiry", "patterns": ["Can you assist me with booking a hotel near the airport?", "Can you provide me with information about the different hotel options available?", "What are the pricing options for hotel reservations?", "Can you assist me with ground transportation arrangements to the hotel?", "Are there any loyalty programs or discounts available for hotel reservations?"], "responses": ["We can assist you with booking a hotel near the airport through our website or customer service center.", "There are a variety of hotel options available, including budget-friendly and luxury hotels.", "Pricing options for hotel reservations vary depending on the hotel and the length of stay.", "We can also assist you with ground transportation arrangements to the hotel.", "There may be loyalty programs or discounts available for hotel reservations, please check with our customer service team."]}, {
        "tag": "tourism_information", "patterns": ["Can you provide me with information about tourist attractions in the city?", "What are the best ways to explore the city?", "Can you assist me with booking a city tour?", "What are the local customs and traditions"], "responses": ["We can provide you with information about popular tourist attractions in the city.", "The best ways to explore the city may vary depending on personal preferences, but options include walking tours, bus tours, and bike tours.", "We can assist you with booking a city tour through our website or customer service center.", "We can also provide information about local customs and traditions to enhance your travel experience."]
        }
    ]
}